Revit 2024 API
ZoneElementDomainData Class
 A base class for specific domain requirements for a zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class ZoneElementDomainData : IDisposable
Visual Basic
Public Class ZoneElementDomainData _
	Implements IDisposable
Visual C++
public ref class ZoneElementDomainData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.ZoneElementDomainData
 Autodesk.Revit.DB.Electrical.AreaBasedLoadData
See Also
ZoneElementDomainData Members
Autodesk.Revit.DB.Mechanical Namespace